## Terraform plan (envs/dev)\n\n<details>\n<summary>Plan summary</summary>\n\n<pre>\ncreate:  0\nupdate:  2\ndelete:  3\nreplace: 0\nread:    2\nno_op:   0\n</pre>\n</details>\n\n<details>\n<summary>Full plan</summary>\n\n<pre>
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
  - destroy
 &lt;= read (data resources)

Terraform will perform the following actions:

  # module.eks[0].aws_eks_addon.ebs_csi_driver[0] will be destroyed
  # (because index [0] is out of range for count)
  - resource "aws_eks_addon" "ebs_csi_driver" {
      - addon_name                  = "aws-ebs-csi-driver" -&gt; null
      - addon_version               = "v1.54.0-eksbuild.1" -&gt; null
      - arn                         = "arn:aws:eks:eu-west-2:593517239005:addon/goldenpath-dev-eks-02-01-26-04/aws-ebs-csi-driver/96cdbeeb-d381-1c78-9a3a-332663f8e576" -&gt; null
      - cluster_name                = "goldenpath-dev-eks-02-01-26-04" -&gt; null
      - configuration_values        = jsonencode(
            {
              - controller = {
                  - replicaCount = 1
                }
            }
        ) -&gt; null
      - created_at                  = "2026-01-02T08:34:03Z" -&gt; null
      - id                          = "goldenpath-dev-eks-02-01-26-04:aws-ebs-csi-driver" -&gt; null
      - modified_at                 = "2026-01-02T08:34:30Z" -&gt; null
      - region                      = "eu-west-2" -&gt; null
      - resolve_conflicts_on_create = "OVERWRITE" -&gt; null
      - resolve_conflicts_on_update = "OVERWRITE" -&gt; null
      - tags                        = {
          - "BuildId"     = "02-01-26-04"
          - "Environment" = "dev"
          - "Lifecycle"   = "ephemeral"
          - "ManagedBy"   = "terraform"
          - "Name"        = "goldenpath-dev-eks-02-01-26-04-aws-ebs-csi-driver"
          - "Owner"       = "platform-team"
          - "Project"     = "goldenpath-idp"
        } -&gt; null
      - tags_all                    = {
          - "BuildId"     = "02-01-26-04"
          - "Environment" = "dev"
          - "Lifecycle"   = "ephemeral"
          - "ManagedBy"   = "terraform"
          - "Name"        = "goldenpath-dev-eks-02-01-26-04-aws-ebs-csi-driver"
          - "Owner"       = "platform-team"
          - "Project"     = "goldenpath-idp"
        } -&gt; null
        # (1 unchanged attribute hidden)
    }

  # module.eks[0].aws_eks_addon.efs_csi_driver[0] will be destroyed
  # (because index [0] is out of range for count)
  - resource "aws_eks_addon" "efs_csi_driver" {
      - addon_name                  = "aws-efs-csi-driver" -&gt; null
      - addon_version               = "v2.1.15-eksbuild.1" -&gt; null
      - arn                         = "arn:aws:eks:eu-west-2:593517239005:addon/goldenpath-dev-eks-02-01-26-04/aws-efs-csi-driver/08cdbeeb-d361-41e2-a053-743570a43dfd" -&gt; null
      - cluster_name                = "goldenpath-dev-eks-02-01-26-04" -&gt; null
      - configuration_values        = jsonencode(
            {
              - controller = {
                  - replicaCount = 1
                }
            }
        ) -&gt; null
      - created_at                  = "2026-01-02T08:34:03Z" -&gt; null
      - id                          = "goldenpath-dev-eks-02-01-26-04:aws-efs-csi-driver" -&gt; null
      - modified_at                 = "2026-01-02T08:34:27Z" -&gt; null
      - region                      = "eu-west-2" -&gt; null
      - resolve_conflicts_on_create = "OVERWRITE" -&gt; null
      - resolve_conflicts_on_update = "OVERWRITE" -&gt; null
      - tags                        = {
          - "BuildId"     = "02-01-26-04"
          - "Environment" = "dev"
          - "Lifecycle"   = "ephemeral"
          - "ManagedBy"   = "terraform"
          - "Name"        = "goldenpath-dev-eks-02-01-26-04-aws-efs-csi-driver"
          - "Owner"       = "platform-team"
          - "Project"     = "goldenpath-idp"
        } -&gt; null
      - tags_all                    = {
          - "BuildId"     = "02-01-26-04"
          - "Environment" = "dev"
          - "Lifecycle"   = "ephemeral"
          - "ManagedBy"   = "terraform"
          - "Name"        = "goldenpath-dev-eks-02-01-26-04-aws-efs-csi-driver"
          - "Owner"       = "platform-team"
          - "Project"     = "goldenpath-idp"
        } -&gt; null
        # (1 unchanged attribute hidden)
    }

  # module.eks[0].aws_eks_addon.snapshot_controller[0] will be destroyed
  # (because index [0] is out of range for count)
  - resource "aws_eks_addon" "snapshot_controller" {
      - addon_name                  = "snapshot-controller" -&gt; null
      - addon_version               = "v8.4.0-eksbuild.3" -&gt; null
      - arn                         = "arn:aws:eks:eu-west-2:593517239005:addon/goldenpath-dev-eks-02-01-26-04/snapshot-controller/26cdbeeb-d365-c20a-a83b-cd74c31f3802" -&gt; null
      - cluster_name                = "goldenpath-dev-eks-02-01-26-04" -&gt; null
      - created_at                  = "2026-01-02T08:34:03Z" -&gt; null
      - id                          = "goldenpath-dev-eks-02-01-26-04:snapshot-controller" -&gt; null
      - modified_at                 = "2026-01-02T08:34:38Z" -&gt; null
      - region                      = "eu-west-2" -&gt; null
      - resolve_conflicts_on_create = "OVERWRITE" -&gt; null
      - resolve_conflicts_on_update = "OVERWRITE" -&gt; null
      - tags                        = {
          - "BuildId"     = "02-01-26-04"
          - "Environment" = "dev"
          - "Lifecycle"   = "ephemeral"
          - "ManagedBy"   = "terraform"
          - "Name"        = "goldenpath-dev-eks-02-01-26-04-snapshot-controller"
          - "Owner"       = "platform-team"
          - "Project"     = "goldenpath-idp"
        } -&gt; null
      - tags_all                    = {
          - "BuildId"     = "02-01-26-04"
          - "Environment" = "dev"
          - "Lifecycle"   = "ephemeral"
          - "ManagedBy"   = "terraform"
          - "Name"        = "goldenpath-dev-eks-02-01-26-04-snapshot-controller"
          - "Owner"       = "platform-team"
          - "Project"     = "goldenpath-idp"
        } -&gt; null
        # (2 unchanged attributes hidden)
    }

  # module.iam[0].data.aws_iam_policy_document.cluster_autoscaler_assume[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 &lt;= data "aws_iam_policy_document" "cluster_autoscaler_assume" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRoleWithWebIdentity",
            ]
          + effect  = "Allow"

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "sts.amazonaws.com",
                ]
              + variable = "oidc.eks.eu-west-2.amazonaws.com/id/48B5B6586E3C6383F9CC59FFEC30D9D4:aud"
            }
          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "system:serviceaccount:kube-system:cluster-autoscaler",
                ]
              + variable = "oidc.eks.eu-west-2.amazonaws.com/id/48B5B6586E3C6383F9CC59FFEC30D9D4:sub"
            }

          + principals {
              + identifiers = [
                  + "arn:aws:iam::593517239005:oidc-provider/oidc.eks.eu-west-2.amazonaws.com/id/48B5B6586E3C6383F9CC59FFEC30D9D4",
                ]
              + type        = "Federated"
            }
        }
    }

  # module.iam[0].data.aws_iam_policy_document.lb_controller_assume[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 &lt;= data "aws_iam_policy_document" "lb_controller_assume" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRoleWithWebIdentity",
            ]
          + effect  = "Allow"

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "sts.amazonaws.com",
                ]
              + variable = "oidc.eks.eu-west-2.amazonaws.com/id/48B5B6586E3C6383F9CC59FFEC30D9D4:aud"
            }
          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "system:serviceaccount:kube-system:aws-load-balancer-controller",
                ]
              + variable = "oidc.eks.eu-west-2.amazonaws.com/id/48B5B6586E3C6383F9CC59FFEC30D9D4:sub"
            }

          + principals {
              + identifiers = [
                  + "arn:aws:iam::593517239005:oidc-provider/oidc.eks.eu-west-2.amazonaws.com/id/48B5B6586E3C6383F9CC59FFEC30D9D4",
                ]
              + type        = "Federated"
            }
        }
    }

  # module.iam[0].aws_iam_role.cluster_autoscaler[0] will be updated in-place
  ~ resource "aws_iam_role" "cluster_autoscaler" {
      ~ assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRoleWithWebIdentity"
                      - Condition = {
                          - StringEquals = {
                              - "oidc.eks.eu-west-2.amazonaws.com/id/48B5B6586E3C6383F9CC59FFEC30D9D4:aud" = "sts.amazonaws.com"
                              - "oidc.eks.eu-west-2.amazonaws.com/id/48B5B6586E3C6383F9CC59FFEC30D9D4:sub" = "system:serviceaccount:kube-system:cluster-autoscaler"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Federated = "arn:aws:iam::593517239005:oidc-provider/oidc.eks.eu-west-2.amazonaws.com/id/48B5B6586E3C6383F9CC59FFEC30D9D4"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -&gt; (known after apply)
        id                    = "goldenpath-idp-cluster-autoscaler-02-01-26-04"
        name                  = "goldenpath-idp-cluster-autoscaler-02-01-26-04"
        tags                  = {
            "BuildId"     = "02-01-26-04"
            "Environment" = "dev"
            "Lifecycle"   = "ephemeral"
            "ManagedBy"   = "terraform"
            "Owner"       = "platform-team"
            "Project"     = "goldenpath-idp"
        }
        # (11 unchanged attributes hidden)
    }

  # module.iam[0].aws_iam_role.lb_controller[0] will be updated in-place
  ~ resource "aws_iam_role" "lb_controller" {
      ~ assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRoleWithWebIdentity"
                      - Condition = {
                          - StringEquals = {
                              - "oidc.eks.eu-west-2.amazonaws.com/id/48B5B6586E3C6383F9CC59FFEC30D9D4:aud" = "sts.amazonaws.com"
                              - "oidc.eks.eu-west-2.amazonaws.com/id/48B5B6586E3C6383F9CC59FFEC30D9D4:sub" = "system:serviceaccount:kube-system:aws-load-balancer-controller"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Federated = "arn:aws:iam::593517239005:oidc-provider/oidc.eks.eu-west-2.amazonaws.com/id/48B5B6586E3C6383F9CC59FFEC30D9D4"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -&gt; (known after apply)
        id                    = "goldenpath-idp-aws-load-balancer-controller-02-01-26-04"
        name                  = "goldenpath-idp-aws-load-balancer-controller-02-01-26-04"
        tags                  = {
            "BuildId"     = "02-01-26-04"
            "Environment" = "dev"
            "Lifecycle"   = "ephemeral"
            "ManagedBy"   = "terraform"
            "Owner"       = "platform-team"
            "Project"     = "goldenpath-idp"
        }
        # (11 unchanged attributes hidden)
    }

Plan: 0 to add, 2 to change, 3 to destroy.
</pre>\n</details>\n\n